###############################################################################
# Created by write_sdc
###############################################################################
current_design user_project_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name io_clock_PAD -period 10.0000 
set_clock_uncertainty 0.2500 io_clock_PAD
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[0]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[10]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[11]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[12]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[13]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[14]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[15]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[16]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[17]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[18]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[19]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[1]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[20]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[21]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[22]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[23]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[24]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[25]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[26]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[27]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[28]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[29]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[2]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[30]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[31]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[32]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[33]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[34]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[35]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[3]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[4]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[5]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[6]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[7]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[8]}]
set_input_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[9]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[0]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[10]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[11]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[12]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[13]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[14]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[15]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[16]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[17]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[18]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[19]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[1]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[20]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[21]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[22]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[23]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[24]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[25]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[26]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[27]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[28]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[29]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[2]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[30]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[31]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[32]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[33]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[34]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[35]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[3]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[4]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[5]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[6]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[7]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[8]}]
set_output_delay 2.0000 -clock [get_clocks {io_clock_PAD}] -add_delay [get_ports {analog_io[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {analog_io[35]}]
set_load -pin_load 0.0060 [get_ports {analog_io[34]}]
set_load -pin_load 0.0060 [get_ports {analog_io[33]}]
set_load -pin_load 0.0060 [get_ports {analog_io[32]}]
set_load -pin_load 0.0060 [get_ports {analog_io[31]}]
set_load -pin_load 0.0060 [get_ports {analog_io[30]}]
set_load -pin_load 0.0060 [get_ports {analog_io[29]}]
set_load -pin_load 0.0060 [get_ports {analog_io[28]}]
set_load -pin_load 0.0060 [get_ports {analog_io[27]}]
set_load -pin_load 0.0060 [get_ports {analog_io[26]}]
set_load -pin_load 0.0060 [get_ports {analog_io[25]}]
set_load -pin_load 0.0060 [get_ports {analog_io[24]}]
set_load -pin_load 0.0060 [get_ports {analog_io[23]}]
set_load -pin_load 0.0060 [get_ports {analog_io[22]}]
set_load -pin_load 0.0060 [get_ports {analog_io[21]}]
set_load -pin_load 0.0060 [get_ports {analog_io[20]}]
set_load -pin_load 0.0060 [get_ports {analog_io[19]}]
set_load -pin_load 0.0060 [get_ports {analog_io[18]}]
set_load -pin_load 0.0060 [get_ports {analog_io[17]}]
set_load -pin_load 0.0060 [get_ports {analog_io[16]}]
set_load -pin_load 0.0060 [get_ports {analog_io[15]}]
set_load -pin_load 0.0060 [get_ports {analog_io[14]}]
set_load -pin_load 0.0060 [get_ports {analog_io[13]}]
set_load -pin_load 0.0060 [get_ports {analog_io[12]}]
set_load -pin_load 0.0060 [get_ports {analog_io[11]}]
set_load -pin_load 0.0060 [get_ports {analog_io[10]}]
set_load -pin_load 0.0060 [get_ports {analog_io[9]}]
set_load -pin_load 0.0060 [get_ports {analog_io[8]}]
set_load -pin_load 0.0060 [get_ports {analog_io[7]}]
set_load -pin_load 0.0060 [get_ports {analog_io[6]}]
set_load -pin_load 0.0060 [get_ports {analog_io[5]}]
set_load -pin_load 0.0060 [get_ports {analog_io[4]}]
set_load -pin_load 0.0060 [get_ports {analog_io[3]}]
set_load -pin_load 0.0060 [get_ports {analog_io[2]}]
set_load -pin_load 0.0060 [get_ports {analog_io[1]}]
set_load -pin_load 0.0060 [get_ports {analog_io[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[35]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[34]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[33]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[32]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[31]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[30]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[29]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[28]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[27]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[26]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[25]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[24]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[23]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[22]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[21]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[20]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[19]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[18]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[17]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[16]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[15]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[14]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[13]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[12]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[11]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[10]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[9]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[8]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[7]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[6]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[5]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[4]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[3]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
